In [1]:
# Pandas is a Python library that is used to manipulate the data as we do in Excel.
# Pandas has been developed over Numpy
# Pandas stands for Panel Data.
# Panel Data means Tabular Data.

### Importing Pandas

In [6]:
import pandas as pd

### Version

In [9]:
pd.__version__

'2.2.2'

In [11]:
# In Pandas we have two type of objects
# - 1 Series
# - 2- Dataframe

In [28]:
import numpy as np

# Series

In [14]:
# - It is like a 1-D array structure.
# - A series can be considered as a column from a table.
# - A series has indexes and values.
# - A series does not contain header.

# Creating a Series

In [17]:
# pd.Series(list/tuple/array/dictionary)

### Creating a series by using a list / tuple or array

In [22]:
lst=[10,20,30,40,50,60,70,80]

nums=pd.Series(lst)
nums

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
dtype: int64

In [26]:
t=(10,20,30,40,50,60,70,80)

nums=pd.Series(t)
nums

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
dtype: int64

In [38]:
arr=np.array([10,20,30,40,50,60,70,80])
nums=pd.Series(arr)
print(nums, type(nums))

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
dtype: int32 <class 'pandas.core.series.Series'>

### Creating a series by using a dictionary

In [41]:
# - When we create a series using a dictionary then.
# - The keys of the dictionary become the indexes in the series.
# - The values of the dictionary become the values.

In [51]:
emp={'Name':'Sankha', 'Age':25, 'City':'Pune', 'Salary':55000}
emp_ser=pd.Series(emp)
emp_ser

Name      Sankha
Age           25
City        Pune
Salary     55000
dtype: object

# Attributes on a Series

In [55]:
# - size
# - shape
# - ndim
# - dtype
# - index
# - values
# - name

### size

In [58]:
# - It returns the number of elements a series contains.

In [66]:
nums

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
dtype: int32

In [62]:
nums.size

8

In [64]:
len(nums)

8

### shape

In [69]:
# - It returns a tuple of sigle element that represents the number of elements.

In [73]:
nums.shape

(8,)

### ndim

In [76]:
# - It returns the dimension of a series i.e. is 1 always.

In [80]:
nums.ndim

1

### dtype

In [85]:
# - It returns the data type of the elements a series contains.
# - A series can contain two type of elements
# - 1- Numeric - int -> float -> complex (array upcasting)
# - 2- Non-numeric - object

In [95]:
lst=[10,20,30,40,50]

s=pd.Series(lst)
s

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [97]:
s.dtype

dtype('int64')

In [99]:
lst=[10,20,30,40.66,50]

s=pd.Series(lst)
s

0    10.00
1    20.00
2    30.00
3    40.66
4    50.00
dtype: float64

In [101]:
s.dtype

dtype('float64')

In [103]:
lst=[10,20,30,40+60j,50]

s=pd.Series(lst)
s

0    10.0+ 0.0j
1    20.0+ 0.0j
2    30.0+ 0.0j
3    40.0+60.0j
4    50.0+ 0.0j
dtype: complex128

In [105]:
s.dtype

dtype('complex128')

In [107]:
lst=[10,20.44,30+60j,40,50]

s=pd.Series(lst)
s

0    10.00+ 0.00j
1    20.44+ 0.00j
2    30.00+60.00j
3    40.00+ 0.00j
4    50.00+ 0.00j
dtype: complex128

In [109]:
s.dtype

dtype('complex128')

In [118]:
lst=[10,20,'30',40,50]

s=pd.Series(lst)
s

0    10
1    20
2    30
3    40
4    50
dtype: object

In [120]:
lst=[[10,5,6,9],20,'30',40,50]

s=pd.Series(lst)
s

0    [10, 5, 6, 9]
1               20
2               30
3               40
4               50
dtype: object

In [122]:
s.dtype

dtype('O')

### index

In [132]:
# - A series has two type of indexes

# - 1- Implicit Index (default / Python defined)
# - 2- Explicit Index (User defined / Labels)

# In case of implicit indexes, it returns a RangeIndex object that contains start, stop and step.
# In case of explicit indexes, it returns Index object that contains the list of indexes / labels.

In [128]:
nums

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
dtype: int32

In [130]:
nums.index

RangeIndex(start=0, stop=8, step=1)

In [134]:
emp_ser

Name      Sankha
Age           25
City        Pune
Salary     55000
dtype: object

In [136]:
emp_ser.index

Index(['Name', 'Age', 'City', 'Salary'], dtype='object')

### values

In [139]:
# - It returns a 1-D array that contains the values of a series.

In [141]:
nums

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
dtype: int32

In [143]:
nums.values

array([10, 20, 30, 40, 50, 60, 70, 80])

In [145]:
emp_ser

Name      Sankha
Age           25
City        Pune
Salary     55000
dtype: object

In [147]:
emp_ser.values

array(['Sankha', 25, 'Pune', 55000], dtype=object)

### name

In [150]:
# - Using name attribute we can name a series.

In [152]:
nums

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
dtype: int32

In [154]:
nums.name='Numbers'

In [156]:
nums

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
Name: Numbers, dtype: int32

In [158]:
emp_ser

Name      Sankha
Age           25
City        Pune
Salary     55000
dtype: object

In [160]:
emp_ser.name='Employee Details'

In [162]:
emp_ser

Name      Sankha
Age           25
City        Pune
Salary     55000
Name: Employee Details, dtype: object

In [168]:
emp_ser.name='emp_details'

In [170]:
emp_ser

Name      Sankha
Age           25
City        Pune
Salary     55000
Name: emp_details, dtype: object

# Indexing and Slicing of a Series

### Indexing

In [174]:
nums

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
Name: Numbers, dtype: int32

In [178]:
nums[5]

60

In [180]:
# - A sereis has two types of indexes
# - 1- Implicit Indexes
# - 2- User defined / Labels

In [182]:
# ser[label]

In [186]:
nums.index=[1,2,3,4,5,6,7,8]

In [188]:
nums

1    10
2    20
3    30
4    40
5    50
6    60
7    70
8    80
Name: Numbers, dtype: int32

In [192]:
# nums[0]

### iloc and loc

In [195]:
# iloc[implicit_index]
# loc[explicit_index]

In [197]:
nums

1    10
2    20
3    30
4    40
5    50
6    60
7    70
8    80
Name: Numbers, dtype: int32

In [201]:
# Get the first element
nums.iloc[0]

10

In [203]:
nums.loc[1]

10

In [343]:
names=['Manish', 'Sankha', 'Deepti', 'Sukesh', 'Priti', 'Vikash', 'Arvind', 'Ayushi']
emp=pd.Series(names, index=['emp_'+str(i) for i in range(1,len(names)+1)])

In [345]:
emp

emp_1    Manish
emp_2    Sankha
emp_3    Deepti
emp_4    Sukesh
emp_5     Priti
emp_6    Vikash
emp_7    Arvind
emp_8    Ayushi
dtype: object

In [215]:
# Get the first name
emp.iloc[0]

'Manish'

In [219]:
# Get the name of the employ who has ID emp_1
emp.loc['emp_1']

'Manish'

In [225]:
# Get the name of emp_6

emp.loc['emp_6']

'Vikash'

In [227]:
# Get the name of the last employee
emp.iloc[-1]

'Ayushi'

In [237]:
# Get the name of emp_8
emp.loc['emp_8']

'Ayushi'

### Assigning user defined indexes to a series

In [240]:
names

['Manish', 'Sankha', 'Deepti', 'Sukesh', 'Priti', 'Vikash', 'Arvind', 'Ayushi']

In [244]:
list('abcdefgh')

['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h']

In [262]:
pd.Series(names, index=tuple('abcdefgh'))

a    Manish
b    Sankha
c    Deepti
d    Sukesh
e     Priti
f    Vikash
g    Arvind
h    Ayushi
dtype: object

In [270]:
names_ser=pd.Series(names)
names_ser

0    Manish
1    Sankha
2    Deepti
3    Sukesh
4     Priti
5    Vikash
6    Arvind
7    Ayushi
dtype: object

In [275]:
names_ser.index=list('abcdefgh')

In [279]:
names_ser

a    Manish
b    Sankha
c    Deepti
d    Sukesh
e     Priti
f    Vikash
g    Arvind
h    Ayushi
dtype: object

### Slicing

In [282]:
# ser.iloc[start:stop:step] (Implicit Indexes)
# stop_index is excluded

# ser.loc[start:stop:step] (Explicit Indexes / Labels)
# stop_index is included

In [284]:
names_ser

a    Manish
b    Sankha
c    Deepti
d    Sukesh
e     Priti
f    Vikash
g    Arvind
h    Ayushi
dtype: object

In [286]:
# First 3 elements
names_ser.iloc[:3]

a    Manish
b    Sankha
c    Deepti
dtype: object

In [290]:
names_ser.loc['a':'c']

a    Manish
b    Sankha
c    Deepti
dtype: object

In [292]:
# Reverse a series
names_ser.iloc[::-1]

h    Ayushi
g    Arvind
f    Vikash
e     Priti
d    Sukesh
c    Deepti
b    Sankha
a    Manish
dtype: object

In [294]:
names_ser.loc['h':'a':-1]

h    Ayushi
g    Arvind
f    Vikash
e     Priti
d    Sukesh
c    Deepti
b    Sankha
a    Manish
dtype: object

In [296]:
names_ser.loc[::-1]

h    Ayushi
g    Arvind
f    Vikash
e     Priti
d    Sukesh
c    Deepti
b    Sankha
a    Manish
dtype: object

In [298]:
names_ser

a    Manish
b    Sankha
c    Deepti
d    Sukesh
e     Priti
f    Vikash
g    Arvind
h    Ayushi
dtype: object

In [300]:
# From f to c
names_ser.loc['f':'c':-1]

f    Vikash
e     Priti
d    Sukesh
c    Deepti
dtype: object

# Conditions on a Series

In [303]:
nums

1    10
2    20
3    30
4    40
5    50
6    60
7    70
8    80
Name: Numbers, dtype: int32

In [305]:
nums>50

1    False
2    False
3    False
4    False
5    False
6     True
7     True
8     True
Name: Numbers, dtype: bool

In [307]:
nums[nums>50]

6    60
7    70
8    80
Name: Numbers, dtype: int32

In [311]:
emp

emp_1    Manish
emp_2    Sankha
emp_3    Deepti
emp_4    Sukesh
emp_5     Priti
emp_6    Vikash
emp_7    Arvind
emp_8    Ayushi
dtype: object

In [325]:
# What is the  emp_id of Sukesh

emp=='Sukesh'

emp_1    False
emp_2    False
emp_3    False
emp_4     True
emp_5    False
emp_6    False
emp_7    False
emp_8    False
dtype: bool

In [331]:
emp[emp=='Sukesh']

emp_4    Sukesh
dtype: object

In [337]:
emp[emp=='Sukesh'].index

Index(['emp_4'], dtype='object')

In [339]:
emp

emp_1    Manish
emp_2    Sankha
emp_3    Deepti
emp_4    Sukesh
emp_5     Priti
emp_6    Vikash
emp_7    Arvind
emp_8    Ayushi
dtype: object

In [353]:
# Vikash should be replaced with Pranali

emp.loc[emp=='Vikash']='Pranali'

In [355]:
emp

emp_1     Manish
emp_2     Sankha
emp_3     Deepti
emp_4     Sukesh
emp_5      Priti
emp_6    Pranali
emp_7     Arvind
emp_8     Ayushi
dtype: object

In [357]:
# Sankha should be replaced with Aditya
emp=='Sankha'

emp_1    False
emp_2     True
emp_3    False
emp_4    False
emp_5    False
emp_6    False
emp_7    False
emp_8    False
dtype: bool

In [365]:
emp.loc[emp=='Sankha']='Aditya'

In [367]:
emp

emp_1     Manish
emp_2     Aditya
emp_3     Deepti
emp_4     Sukesh
emp_5      Priti
emp_6    Pranali
emp_7     Arvind
emp_8     Ayushi
dtype: object

# Data Frame

In [375]:
# - A data frame is like a 2-D array structure.
# - It can be considered as an Excel table.
# - Data frame has row as well column indexes.

# Creating a dataframe

### By using a 2-D list

In [387]:
# pd.DataFrame(2-D list)

In [379]:
names=['Kushagra', 'Kartik', 'Vikash', 'Sukesh', 'Deepti', 'Priti', 'Pranali', 'Amit']
codes=[101, 102, 103, 104, 105, 106, 107, 108]
city=['Pune', 'Madurai', 'Chennai', 'Dehradun', 'Noida', 'Bengaluru', 'Mysuru', 'Goa']

In [385]:
data=[names, codes, city]
print(data)

[['Kushagra', 'Kartik', 'Vikash', 'Sukesh', 'Deepti', 'Priti', 'Pranali', 'Amit'], [101, 102, 103, 104, 105, 106, 107, 108], ['Pune', 'Madurai', 'Chennai', 'Dehradun', 'Noida', 'Bengaluru', 'Mysuru', 'Goa']]

In [389]:
pd.DataFrame(data)

          0        1        2         3       4          5        6     7
0  Kushagra   Kartik   Vikash    Sukesh  Deepti      Priti  Pranali  Amit
1       101      102      103       104     105        106      107   108
2      Pune  Madurai  Chennai  Dehradun   Noida  Bengaluru   Mysuru   Goa

In [393]:
df=pd.DataFrame(data).T

In [395]:
df

          0    1          2
0  Kushagra  101       Pune
1    Kartik  102    Madurai
2    Vikash  103    Chennai
3    Sukesh  104   Dehradun
4    Deepti  105      Noida
5     Priti  106  Bengaluru
6   Pranali  107     Mysuru
7      Amit  108        Goa

In [397]:
df.columns=['Name', 'ID', 'City']

In [399]:
df

       Name   ID       City
0  Kushagra  101       Pune
1    Kartik  102    Madurai
2    Vikash  103    Chennai
3    Sukesh  104   Dehradun
4    Deepti  105      Noida
5     Priti  106  Bengaluru
6   Pranali  107     Mysuru
7      Amit  108        Goa

In [401]:
data=[['Kushagra', 101, 'Pune'], ['Kartik', 102, 'Madurai'], ['Vikash', 103, 'Chennai'], ['Sukesh', 104, 'Dehradun']]
print(data)

[['Kushagra', 101, 'Pune'], ['Kartik', 102, 'Madurai'], ['Vikash', 103, 'Chennai'], ['Sukesh', 104, 'Dehradun']]

In [407]:
df=pd.DataFrame(data, columns=['Name', 'ID', 'City'])

In [409]:
df

       Name   ID      City
0  Kushagra  101      Pune
1    Kartik  102   Madurai
2    Vikash  103   Chennai
3    Sukesh  104  Dehradun

### Creating a datafrme using Series

In [425]:
name_ser=pd.Series(names)
code_ser=pd.Series(codes)
city_ser=pd.Series(city)

In [427]:
name_ser

0    Kushagra
1      Kartik
2      Vikash
3      Sukesh
4      Deepti
5       Priti
6     Pranali
7        Amit
dtype: object

In [429]:
code_ser

0    101
1    102
2    103
3    104
4    105
5    106
6    107
7    108
dtype: int64

In [431]:
city_ser

0         Pune
1      Madurai
2      Chennai
3     Dehradun
4        Noida
5    Bengaluru
6       Mysuru
7          Goa
dtype: object

In [435]:
data=[name_ser, code_ser, city_ser]

In [438]:
data

[0    Kushagra
 1      Kartik
 2      Vikash
 3      Sukesh
 4      Deepti
 5       Priti
 6     Pranali
 7        Amit
 dtype: object,
 0    101
 1    102
 2    103
 3    104
 4    105
 5    106
 6    107
 7    108
 dtype: int64,
 0         Pune
 1      Madurai
 2      Chennai
 3     Dehradun
 4        Noida
 5    Bengaluru
 6       Mysuru
 7          Goa
 dtype: object]

In [444]:
df=pd.DataFrame(data).T

In [446]:
df

          0    1          2
0  Kushagra  101       Pune
1    Kartik  102    Madurai
2    Vikash  103    Chennai
3    Sukesh  104   Dehradun
4    Deepti  105      Noida
5     Priti  106  Bengaluru
6   Pranali  107     Mysuru
7      Amit  108        Goa

In [448]:
df.columns=['Name','ID','City']

In [450]:
df

       Name   ID       City
0  Kushagra  101       Pune
1    Kartik  102    Madurai
2    Vikash  103    Chennai
3    Sukesh  104   Dehradun
4    Deepti  105      Noida
5     Priti  106  Bengaluru
6   Pranali  107     Mysuru
7      Amit  108        Goa

In [458]:
name_ser.name='Name'

In [460]:
code_ser.name='ID'

In [462]:
city_ser.name='City'

In [464]:
name_ser

0    Kushagra
1      Kartik
2      Vikash
3      Sukesh
4      Deepti
5       Priti
6     Pranali
7        Amit
Name: Name, dtype: object

In [466]:
code_ser

0    101
1    102
2    103
3    104
4    105
5    106
6    107
7    108
Name: ID, dtype: int64

In [468]:
city_ser

0         Pune
1      Madurai
2      Chennai
3     Dehradun
4        Noida
5    Bengaluru
6       Mysuru
7          Goa
Name: City, dtype: object

In [472]:
data=[name_ser, code_ser, city_ser]

In [478]:
df=pd.DataFrame(data).T

In [480]:
df

       Name   ID       City
0  Kushagra  101       Pune
1    Kartik  102    Madurai
2    Vikash  103    Chennai
3    Sukesh  104   Dehradun
4    Deepti  105      Noida
5     Priti  106  Bengaluru
6   Pranali  107     Mysuru
7      Amit  108        Goa

### By using a dictionary

In [483]:
# - The keys become the column headers.
# - The values become the values.

In [493]:
data={'Name':names, 'ID':codes, 'City':city}

In [495]:
data['Name']

['Kushagra',
 'Kartik',
 'Vikash',
 'Sukesh',
 'Deepti',
 'Priti',
 'Pranali',
 'Amit']

In [497]:
data['City']

['Pune',
 'Madurai',
 'Chennai',
 'Dehradun',
 'Noida',
 'Bengaluru',
 'Mysuru',
 'Goa']

In [499]:
data['ID']

[101, 102, 103, 104, 105, 106, 107, 108]

In [503]:
df=pd.DataFrame(data)

In [505]:
df

       Name   ID       City
0  Kushagra  101       Pune
1    Kartik  102    Madurai
2    Vikash  103    Chennai
3    Sukesh  104   Dehradun
4    Deepti  105      Noida
5     Priti  106  Bengaluru
6   Pranali  107     Mysuru
7      Amit  108        Goa

In [507]:
# - When we create a dataframe using dictionary then we can change the column order.
# - We can also add new columns.

In [511]:
pd.DataFrame(data, columns=['ID', 'Name','City'])

    ID      Name       City
0  101  Kushagra       Pune
1  102    Kartik    Madurai
2  103    Vikash    Chennai
3  104    Sukesh   Dehradun
4  105    Deepti      Noida
5  106     Priti  Bengaluru
6  107   Pranali     Mysuru
7  108      Amit        Goa

In [517]:
df=pd.DataFrame(data, columns=['ID','Name','City','Company','Salary'])

In [519]:
df

    ID      Name       City Company Salary
0  101  Kushagra       Pune     NaN    NaN
1  102    Kartik    Madurai     NaN    NaN
2  103    Vikash    Chennai     NaN    NaN
3  104    Sukesh   Dehradun     NaN    NaN
4  105    Deepti      Noida     NaN    NaN
5  106     Priti  Bengaluru     NaN    NaN
6  107   Pranali     Mysuru     NaN    NaN
7  108      Amit        Goa     NaN    NaN

In [521]:
df['Company']='TCS'

In [523]:
df

    ID      Name       City Company Salary
0  101  Kushagra       Pune     TCS    NaN
1  102    Kartik    Madurai     TCS    NaN
2  103    Vikash    Chennai     TCS    NaN
3  104    Sukesh   Dehradun     TCS    NaN
4  105    Deepti      Noida     TCS    NaN
5  106     Priti  Bengaluru     TCS    NaN
6  107   Pranali     Mysuru     TCS    NaN
7  108      Amit        Goa     TCS    NaN

In [525]:
df['Salary']='Not-Disclosed'

In [527]:
df

    ID      Name       City Company         Salary
0  101  Kushagra       Pune     TCS  Not-Disclosed
1  102    Kartik    Madurai     TCS  Not-Disclosed
2  103    Vikash    Chennai     TCS  Not-Disclosed
3  104    Sukesh   Dehradun     TCS  Not-Disclosed
4  105    Deepti      Noida     TCS  Not-Disclosed
5  106     Priti  Bengaluru     TCS  Not-Disclosed
6  107   Pranali     Mysuru     TCS  Not-Disclosed
7  108      Amit        Goa     TCS  Not-Disclosed

# Attributes on a Dataframe

In [530]:
# size
# shape
# ndim
# index
# columns
# values
# dtypes

### size

In [533]:
# - It returns the numebr of elememts a dataframe contains.

In [535]:
df

    ID      Name       City Company         Salary
0  101  Kushagra       Pune     TCS  Not-Disclosed
1  102    Kartik    Madurai     TCS  Not-Disclosed
2  103    Vikash    Chennai     TCS  Not-Disclosed
3  104    Sukesh   Dehradun     TCS  Not-Disclosed
4  105    Deepti      Noida     TCS  Not-Disclosed
5  106     Priti  Bengaluru     TCS  Not-Disclosed
6  107   Pranali     Mysuru     TCS  Not-Disclosed
7  108      Amit        Goa     TCS  Not-Disclosed

In [537]:
df.size

40

In [539]:
# len(df) -> It returns the number of rows.

In [541]:
len(df)

8

### Sahpe

In [546]:
# - It returns a tuple of 2 elements.
# - The first element represents the rows, the second element represents the columns.

In [548]:
df.shape

(8, 5)

### ndim

In [553]:
# - It returns the dimension of a dataframe i.e. 2

In [555]:
df.ndim

2

### index

In [560]:
# - A dataframe may have implicit and explicit indexes.

# - In case of implicit indexes, it returns the RangeIndex object that contains start, stop and step for row index.
# - In case of iexplicit indexes, it returns the Index object that contains a list of row index.

In [562]:
df

    ID      Name       City Company         Salary
0  101  Kushagra       Pune     TCS  Not-Disclosed
1  102    Kartik    Madurai     TCS  Not-Disclosed
2  103    Vikash    Chennai     TCS  Not-Disclosed
3  104    Sukesh   Dehradun     TCS  Not-Disclosed
4  105    Deepti      Noida     TCS  Not-Disclosed
5  106     Priti  Bengaluru     TCS  Not-Disclosed
6  107   Pranali     Mysuru     TCS  Not-Disclosed
7  108      Amit        Goa     TCS  Not-Disclosed

In [564]:
df.index

RangeIndex(start=0, stop=8, step=1)

In [566]:
df.index=list('abcdefgh')

In [568]:
df

    ID      Name       City Company         Salary
a  101  Kushagra       Pune     TCS  Not-Disclosed
b  102    Kartik    Madurai     TCS  Not-Disclosed
c  103    Vikash    Chennai     TCS  Not-Disclosed
d  104    Sukesh   Dehradun     TCS  Not-Disclosed
e  105    Deepti      Noida     TCS  Not-Disclosed
f  106     Priti  Bengaluru     TCS  Not-Disclosed
g  107   Pranali     Mysuru     TCS  Not-Disclosed
h  108      Amit        Goa     TCS  Not-Disclosed

In [572]:
df.index

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'], dtype='object')

### columns

In [577]:
# - We may have two types of column indexes -> Implicit / Explicit

# - In case of implicit indexes, it returns the RangeIndex object that contains start, stop and step for column index.
# - In case of iexplicit indexes, it returns the Index object that contains a list of column index.

In [583]:
df=pd.DataFrame([names, codes, city]).T

In [585]:
df

          0    1          2
0  Kushagra  101       Pune
1    Kartik  102    Madurai
2    Vikash  103    Chennai
3    Sukesh  104   Dehradun
4    Deepti  105      Noida
5     Priti  106  Bengaluru
6   Pranali  107     Mysuru
7      Amit  108        Goa

In [587]:
df.index

RangeIndex(start=0, stop=8, step=1)

In [589]:
df.columns

RangeIndex(start=0, stop=3, step=1)

In [591]:
df.columns=['Name', 'ID', 'City']

In [593]:
df

       Name   ID       City
0  Kushagra  101       Pune
1    Kartik  102    Madurai
2    Vikash  103    Chennai
3    Sukesh  104   Dehradun
4    Deepti  105      Noida
5     Priti  106  Bengaluru
6   Pranali  107     Mysuru
7      Amit  108        Goa

In [595]:
df.columns

Index(['Name', 'ID', 'City'], dtype='object')

### values

In [598]:
# - It returns a 2-D array that contains all the values of a dataframe.

In [600]:
df

       Name   ID       City
0  Kushagra  101       Pune
1    Kartik  102    Madurai
2    Vikash  103    Chennai
3    Sukesh  104   Dehradun
4    Deepti  105      Noida
5     Priti  106  Bengaluru
6   Pranali  107     Mysuru
7      Amit  108        Goa

In [602]:
df.values

array([['Kushagra', 101, 'Pune'],
       ['Kartik', 102, 'Madurai'],
       ['Vikash', 103, 'Chennai'],
       ['Sukesh', 104, 'Dehradun'],
       ['Deepti', 105, 'Noida'],
       ['Priti', 106, 'Bengaluru'],
       ['Pranali', 107, 'Mysuru'],
       ['Amit', 108, 'Goa']], dtype=object)

### dtypes

In [605]:
# - - It returns a series that contains the datatype of each column in a dataframe.

In [632]:
data

{'Name': ['Kushagra',
  'Kartik',
  'Vikash',
  'Sukesh',
  'Deepti',
  'Priti',
  'Pranali',
  'Amit'],
 'ID': [101, 102, 103, 104, 105, 106, 107, 108],
 'City': ['Pune',
  'Madurai',
  'Chennai',
  'Dehradun',
  'Noida',
  'Bengaluru',
  'Mysuru',
  'Goa']}

In [613]:
df=pd.DataFrame(data)

In [615]:
df

       Name   ID       City
0  Kushagra  101       Pune
1    Kartik  102    Madurai
2    Vikash  103    Chennai
3    Sukesh  104   Dehradun
4    Deepti  105      Noida
5     Priti  106  Bengaluru
6   Pranali  107     Mysuru
7      Amit  108        Goa

In [617]:
df.dtypes

Name    object
ID       int64
City    object
dtype: object

# Indexing and Slicing

### Indexing

In [626]:
import re

In [630]:
text='''
Mr.Kushagra
@##$%%$^
Eric
324354657
Mrs. Sarah
we432456676
adam
432564767865
Ms Tina
@$#@%#^$%&
Mr_Manish
Ms. Deepika
Peter
Mr.....................Yogesh
Ms__________Deepa
Mr. S
Mrs@'''

# pat = r'(Mrs|Mr|Ms)[._ ]*[A-Z][a-z]+'

pat=r'(Mrs|Mr|Ms)\.?_? ?[A-Z][a-z]+'
#pat=r'M(rs|r|s)'
for i in re.finditer(pat, text):
    print(i)

<re.Match object; span=(1, 12), match='Mr.Kushagra'>
<re.Match object; span=(37, 47), match='Mrs. Sarah'>
<re.Match object; span=(78, 85), match='Ms Tina'>
<re.Match object; span=(97, 106), match='Mr_Manish'>
<re.Match object; span=(107, 118), match='Ms. Deepika'>

In [648]:
text="""
ashishsom@learnbay.co
#@$#%$^&
123@.com
Wewret4657
surendra_singh@gmail.com
abc@123
sfft57678
yogesh.2005@rediffmail.com
@hotmail.com
deepika_engineer.123@gmail.com
abc.com
info@gov.in
SFSDGRY45768768
university@cambridge.edu
rahul.yadav@hotmail.com
sankha1111@gmail.com"""

pat=r'[a-z]+[_.]?[0-9a-z]*\.?[0-9]*@[a-z]+(.com|.co.in|.co|.in|.edu)'

for i in re.finditer(pat, text):
    print(i)

<re.Match object; span=(1, 22), match='ashishsom@learnbay.co'>
<re.Match object; span=(52, 76), match='surendra_singh@gmail.com'>
<re.Match object; span=(95, 121), match='yogesh.2005@rediffmail.com'>
<re.Match object; span=(135, 165), match='deepika_engineer.123@gmail.com'>
<re.Match object; span=(174, 185), match='info@gov.in'>
<re.Match object; span=(202, 226), match='university@cambridge.edu'>
<re.Match object; span=(227, 250), match='rahul.yadav@hotmail.com'>
<re.Match object; span=(251, 271), match='sankha1111@gmail.com'>

In [668]:
name='Snehal *&^%deepika()%$#@!Sakshi manthan *&^%#&Raghu radha &$#@$^&Maya sandeep 23345*&^%Pranjal arya Swati ()90876medha Shashi &^%$_manoj Kiran &*^$0gandhar C'
pat=r'[A-Za-z][a-z]*'

for i in re.finditer(pat,name):
    print(i)

<re.Match object; span=(0, 6), match='Snehal'>
<re.Match object; span=(11, 18), match='deepika'>
<re.Match object; span=(25, 31), match='Sakshi'>
<re.Match object; span=(32, 39), match='manthan'>
<re.Match object; span=(46, 51), match='Raghu'>
<re.Match object; span=(52, 57), match='radha'>
<re.Match object; span=(65, 69), match='Maya'>
<re.Match object; span=(70, 77), match='sandeep'>
<re.Match object; span=(87, 94), match='Pranjal'>
<re.Match object; span=(95, 99), match='arya'>
<re.Match object; span=(100, 105), match='Swati'>
<re.Match object; span=(113, 118), match='medha'>
<re.Match object; span=(119, 125), match='Shashi'>
<re.Match object; span=(131, 136), match='manoj'>
<re.Match object; span=(137, 142), match='Kiran'>
<re.Match object; span=(148, 155), match='gandhar'>
<re.Match object; span=(156, 157), match='C'>

In [670]:
import numpy as np

In [672]:
x=np.random.randint(10,100,size=(3,4))

In [674]:
x

array([[83, 65, 81, 83],
       [65, 30, 63, 10],
       [85, 27, 56, 35]])

In [682]:
np.random.choice(x.flatten(),2)

array([65, 81])

In [684]:
['emp_'+str(i) for i in range(1,9)]

['emp_1', 'emp_2', 'emp_3', 'emp_4', 'emp_5', 'emp_6', 'emp_7', 'emp_8']

In [700]:
['emp_'+str(i) for i in range(1,9)]

['emp_1', 'emp_2', 'emp_3', 'emp_4', 'emp_5', 'emp_6', 'emp_7', 'emp_8']